{
    "salary_informations": {
        "salary_fixed_allowances": [
            "List all entities and elements that related salary fixed allowances. These are the types of allowances that are defined and fixed in advance, usually given to the fixed amount received, the least, the most. Can be defined in numeric or literal form, please pay attention to this for example 結婚や出産のお祝い事に5万円が支給される制度 of Memorial Gift, it have 5万円 it is fixed, so Memorial Gift is in salary_fixed_allowances. And if it NOT HAVE ANY NUMERIC, it will not fixed allowance(example: 管理職に支給される役職手当)."
        ],
        "salary_variable_allowances": [
            "List all entities and elements of related variable allowances.These are the types of allowances that the amount received will be achieved through the agreement, usually only general information and no specific number. Some cases need attention, such as the travel allowance will depend on the distance of the house, which sounds unrelated to the variable allownce but it has no data so it belongs to the variable allowance"
        ],
        "salary_type_id": "Type of salary. Choose one in  salary_type_id",
        "min_basic_salary": "string: Interger of min basic salary",
        "max_basic_salary": "string: Interger of max basic salary",
        "overtime_salary_id": "Choose one in overtime_salary_id",
        "overtime_salary_min": "string: Interger of min overtime salary",
        "overtime_salary_max": "string: Interger of max overtime salary",
        "exceeding_overtime_id": "Choose one in exceeding_overtime_id",
        "allowance_flag": "string: boolean Indicates whether any type of allowance is provided (true or false)",
        "allowance_detail": "string: Provides specific details about any allowances offered (e.g., type of allowance, conditions).",
        "overtime_excluded_object_id": "Choose one in overtime_excluded_object_id",
        "min_monthly_salary": "string: The integer of The minimum monthly salary offered for a job or employee.",
        "max_monthly_salary": "string: The integer of The maximum monthly salary offered for a job or employee.",
        "salary_detail": "string: Additional details or breakdown of the salary offered, such as components, conditions, or bonuses.",
        "salary_payment_method_id": "Choose one in salary_payment_method_id",
        "salary_payment_method_detail": "string: Information on how the salary is paid ",
        "daily_salary": "string: The amount of salary calculated on a daily basis",
        "hourly_salary": "string: The amount of salary calculated on a hourly basis",
        "hybrid_payment_method_memo": "string: Notes or details about a mixed or hybrid salary payment method",
        "skip_entry_flag": "string:  Likely a boolean flag to indicate whether to skip entry or processing for this record or a specific section.",
        "max_annual_income": "string: Interger of The maximum annual income that can be earned",
        "min_annual_income": "string: Interger of The minimum annual income that can be earned",
        "allowance_commute_money_type_id": "commuting allowance. Choose one in allowance_commute_money_type_id",
        "allowance_commute_flag": "string: The boolean Indicates whether a commuting allowance is provided",
        "allowance_commute_money_value": "string: Integer of The monetary value of the commuting allowance, if provided.",
        "allowance_commute_detail": "string: Additional details about the commuting allowance ",
        "bonus_flag": "string: boolean that whether a bonus is provided",
        "bonus": "string: The amount or details of the bonus offered.",
        "salary_raise_id": "Choose one in salary_raise_id",
        "salary_railse_memo": "string: Notes or information about salary increases or raises",
        "salary_model": "string: Describes the salary structure or model (e.g., fixed, commission-based, mixed)."
    },
    "job_posting": {
        "confirmation_date": "string: date type data, The date when the job posting or offer was confirmed or finalized.",
        "comment": "strings: Any additional comments or notes related to the job posting, possibly including special instructions or remarks.",
        "job_name_main_id": "Job categories. Choose one or more in job_name_main_id",
        "occupational_category_ids": " different occupational categories or job classifications. Choose one or more in occupational_category_ids",
        "position": "string: job title position",
        "position_tail": "string:  Additional text or detail that may follow the main position title,",
        "offer_background": "string: recruiment background",
        "future_job_description_id": "Possible future job opportunities. Choose one in future_job_description_id",
        "job_description": "string: A detailed description of the job responsibilities, duties, and expectations",
        "job_charm_details1": "string: A highlight or detail that makes the job attractive or unique,",
        "job_charm_details2": "string: The second detail highlighting something attractive about the job.",
        "job_charm_details3": "string: The third detail highlighting something attractive about the job.",
        "job_charm1_id": "Job charm type. Choose one in job_charm1_id",
        "job_charm2_id": "Job charm type. Choose one in job_charm2_id",
        "job_charm3_id": "Job charm type. Choose one in job_charm3_id",
        "future_job_description_detail": "Details regarding potential future responsibilities, tasks, or growth opportunities that may be associated with the position."
    },
    "location_details": {
        "prefecture_ids": "List of location that working. Choose one or more in prefecture_ids",
        "area_details": "string: Specific details about the area or location of the workplace (e.g., neighborhood, district).",
        "future_workplace_id": "Workplace in future. Choose one in future_workplace_id",
        "future_workplace_detail": "string: Information about potential future workplaces or locations where the employee might be required to work.",
        "transfer_id": "Tranfer",
        "transfer_detail": "string: Details regarding the possibility or requirements for transfers, including conditions, frequency, or locations."
    },
    "job_working_hours": {
        "working_hours_partterns": [
            "List all information and elements of working hours partterns"
        ],
        "working_hours_type_id": "Choose the type of woking hourse in here: working_hours_type_id",
        "scheduled_working_hours_start": "string: integer The scheduled start time of the working hours",
        "scheduled_working_hours_end": "string: integer the scheduled end time of the working hours",
        "actual_working_hour": "string: integer The actual number of working hours recorded.",
        "actual_working_minute": "string: integer: The actual number of working minutes recorded.",
        "break_time_hour": "string: :integer: The number of hours allocated for breaks.",
        "break_time_minute": "string: integer: The number of minutes allocated for breaks.",
        "overtime_working_flag": "string: boolean: Indicates whether overtime work is required or expected.",
        "working_hours_detail": "string: Additional details or notes about the working hours, including any special conditions or arrangements.",
        "min_ave_month_overtime_hour": "string: integer: The minimum average number of overtime hours per month.",
        "min_ave_month_overtime_minute": "string: integer: The minimum average number of overtime minutes per month.",
        "max_ave_month_overtime_hour": "string: integer: The maximum average number of overtime hours per month.",
        "max_ave_month_overtime_minute": "string: integer: The maximum average number of overtime minutes per month.",
        "discretionary_labor_system_type_id": "Choose one the discretionary_labor system type in discretionary_labor_system_type_id",
        "deemed_working_hour": "string: integer: The number of deemed or assumed working hours, used in cases like flexible working arrangements.",
        "deemed_working_minute": "string: integer: The number of deemed or assumed working minutes.",
        "office_work_id": "Choose one the office work in office_work_id",
        "variable_working_hours_type_id": "Choose one the type of variable working hourse in variable_working_hours_type_id",
        "ave_working_hour": "string: integer: The average number of working hours per period (e.g., week, month).",
        "ave_working_minute": "string: integer: The average number of working minutes per period.",
        "standard_working_hour": "string integer: The standard or expected number of working hours per period.",
        "standard_working_minute": "string integer: The standard or expected number of working minutes per period.",
        "core_time_flag": "string: boolean: Indicates whether core working hours (mandatory presence hours) are in place.",
        "contract_working_hours_system_id": "Choose one the contract working hourse system in contract_working_hours_system_id",
        "regular_week_working_hour": "string integer: The total number of regular working hours in a week.",
        "regular_week_working_minute": "string integer: The total number of regular working minutes in a week.",
        "core_time_hours_start": "string: interger :The start time of core working hours.",
        "core_time_hours_end": "string: interger: The end time of core working hours.",
        "flex_time_hours_start": "string: interger: The start time of flexible working hours.",
        "flex_time_hours_end": "string: integer: The end time of flexible working hours.",
        "second_flex_time_hours_start": "string: integer The start time of a second flexible working period, if applicable.",
        "second_flex_time_hours_end": "string: integer The end time of a second flexible working period, if applicable.",
        "overtime_max_hour": "string: integer: The maximum number of overtime hours allowed.",
        "overtime_min_hour": "string: integer: The miniimum number of overtime hours allowed.",
        "overtime_max_minute": "string: integer: The maximum number of overtime minutes allowed.",
        "overtime_min_minute": "string: integer: The minimum number of overtime minutes expected.",
        "working_hours_condition": "string: Conditions or special circumstances related to working hours, such as seasonal variations, shifts, or special projects."
    },
    "remote_work_details": {
        "remote_type_ids": "Remote type. Choose one or more in remote_type_ids",
        "remote_flag": "string: boolean: Indicates whether remote work is allowed or available.",
        "remote_day_min": "string: integer: The minimum number of days per week that remote work is permitted.",
        "remote_day_max": "string: integer: The maximum number of days per week that remote work is permitted.",
        "remote_detail": "string: Additional details or notes about the remote work policy, including conditions or limitations."
    },
    "smoking_prevention_details": {
        "smoking_prevention_content_id": "The smoling prevention content. Choose one in here: smoking_prevention_content_id",
        "smoking_prevention_flag": "string: boolean: Indicates whether there are any smoking prevention measures or policies in place.",
        "smoking_prevention_detail": "string: Specific details about the smoking prevention policy or measures, such as designated smoking areas or non-smoking premises."
    },
    "age_and_gender": {
        "age_genders": "sting: age and gender composition of department"
    },
    "recruiment_and_hiring": {
        "number_hired": "string: integer: The number of positions available for hiring.",
        "prerequisite": "string: Any prerequisites or required qualifications for the job, such as education or experience.",
        "strictness": "string: Describes the level of strictness or flexibility in meeting the prerequisites or job requirements.",
        "selection_process": "string: Details about the recruitment and selection process, including steps such as interviews, tests, or assessments.",
        "inexperience_field": "sting: boolean: Indicates whether candidates with no experience in the field are considered.",
        "inexperience_job": "string: boolean: Indicates whether candidates with no experience in the specific job role are considered",
        "english_ids": "enlish level. Choose one in english_ids"
    },
    "holidays_and_leaves": {
        "holidays_system_id": "system holidays. Choose one in holidays_system_id",
        "holidays": "string: Annual of holidays of company",
        "holidays_breakdown_ids": "Choose one or more in holidays_breakdown_ids",
        "holidays_remarks": "string: Holiday vacation details"
    },
    "welfare_insurance": {
        "insurance_ids": "list of insurance. Choose one or more in insurance_ids",
        "welfare": "string: treatment and benefit of company"
    },
    "employment_type_period": {
        "employment_type_ids": "List of employment type. Choose one or more in employment_type_ids",
        "employment_period_type_id": "employment_period_type. Chooe one in employment_period_type_id",
        "employment_type_remarks": "string Additional remarks or notes about the employment type, such as specific terms or conditions.",
        "employment_period_detail": "string: : Details regarding the employment period, including contract length, renewal conditions, or probationary period"
    },
    "trial_period": {
        "trial_period_id": "trial period. Choose one in trial_period_id",
        "trial_period_length": "string: integer: The length of the trial or probationary period, typically measured in months.",
        "trial_period_working_conditions": "string: The working conditions during the trial period, which may differ from the regular conditions (e.g., salary, working hours).",
        "trial_period_memo": "string: Additional notes or details regarding the trial period, such as performance expectations or evaluation criteria."
    },
    "contract_renewal": {
        "contract_renewal_flag": "string: boolean: Indicates whether the contract is eligible for renewal.",
        "contract_renewal_detail": "string: Additional details about the contract renewal process, such as conditions or timelines.",
        "employment_promotion_flag": "string: boolean: Indicates whether there is a possibility of promotion to permanent employment upon contract renewal.",
        "contract_renewal_criteria": "string: Criteria or conditions that must be met for the contract to be renewed, such as performance metrics or company needs.",
        "contract_renewal_limit_flag": "string: boolean: Indicates whether there is a limit to the number of times the contract can be renewed.",
        "contract_renewal_limit_detail_day": "string: integer: Specifies the day limit for the contract renewal, if applicable.",
        "contract_renewal_limit_detail_month": "string: integer: Specifies the month limit for the contract renewal, if applicable.",
        "contract_renewal_limit_detail_type": "string: Type of limit applied to the contract renewal (e.g., time-based, occurrence-based).",
        "contract_renewal_limit_detail_year": "string: integer: Specifies the year limit for the contract renewal, if applicable."
    }
}